app/views/users/show.html.erb

<div class="reservationlist">
  <% @user.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]

    <p id="reservation-info">
       Restaurant: <%= Restaurant.find(reservation.restaurant_id).name %><br>
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]