app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @reservation = Reservation.find(params[:id])

INSERT INTO "reservations" ("party_size", "date", "comment", "time", "restaurant_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reservation = Reservation.new(reservation_params)
    @reservation.restaurant = @restaurant
    @reservation.user_id = session[:user_id]

    if @reservation.save