app/controllers/restaurants_controller.rb

  def index
     @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants" WHERE (name LIKE '%pizza%')  ORDER BY created_at DESC

  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.owner_id = params[:user_id]
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "phone", "capacity", "website", "photo", "opening_hours", "closing_hours", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def find_user
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]